{"keras_version": "2.0.4", "config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["lstm_1", 0, 0]], "name": "model_2", "layers": [{"name": "input_1", "config": {"batch_input_shape": [null, 20, 5], "name": "input_1", "dtype": "float32", "sparse": false}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "lstm_1", "config": {"recurrent_activation": "hard_sigmoid", "go_backwards": false, "recurrent_dropout": 0.0, "unroll": false, "trainable": true, "return_sequences": false, "stateful": false, "kernel_regularizer": null, "name": "lstm_1", "recurrent_constraint": null, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "recurrent_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "implementation": 0, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.0, "kernel_constraint": null, "unit_forget_bias": true, "units": 7, "activation": "tanh"}, "class_name": "LSTM", "inbound_nodes": [[["input_1", 0, 0, {}]]]}]}, "class_name": "Model", "backend": "tensorflow"}