{"keras_version": "2.0.4", "backend": "tensorflow", "class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_1", "batch_input_shape": [null, 20, 5], "sparse": false}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "lstm_1", "class_name": "LSTM", "config": {"dropout": 0.0, "return_sequences": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "trainable": true, "name": "lstm_1", "recurrent_dropout": 0.0, "stateful": false, "unroll": false, "go_backwards": false, "activation": "tanh", "units": 7, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "kernel_constraint": null, "implementation": 0, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["lstm_1", 0, 0, {}]]], "name": "repeat_vector_1", "class_name": "RepeatVector", "config": {"n": 20, "trainable": true, "name": "repeat_vector_1"}}, {"inbound_nodes": [[["repeat_vector_1", 0, 0, {}]]], "name": "lstm_2", "class_name": "LSTM", "config": {"dropout": 0.0, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "trainable": true, "name": "lstm_2", "recurrent_dropout": 0.0, "stateful": false, "unroll": false, "go_backwards": false, "activation": "tanh", "units": 5, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "kernel_constraint": null, "implementation": 0, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "name": "model_1", "output_layers": [["lstm_2", 0, 0]], "input_layers": [["input_1", 0, 0]]}}